---
kind: property
id: P:Autodesk.Revit.DB.ProjectInfo.BuildingName
source: html/eba07485-cabc-350a-5d20-cda64fed9bfd.htm
---
# Autodesk.Revit.DB.ProjectInfo.BuildingName Property

Get or Set the Building Name of the Project Information.

## Syntax (C#)
```csharp
public string BuildingName { get; set; }
```

## Remarks
This property is used to get or set the Project Number of the Project Information.